test/bench/evidence/20260712-1453-e6841a250/c_read_16k-linux-r3.log
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.hle [bit 4]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.rtm [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512f [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512dq [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512cd [bit 28]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512bw [bit 30]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512vl [bit 31]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi [bit 1]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi2 [bit 6]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vnni [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512bitalg [bit 12]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512-vpopcntdq [bit 14]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.la57 [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=80000008h].EBX.wbnoinvd [bit 9]
cSeaBIOS (version rel-1.17.0-0-gb52ca86e094d-prebuilt.qemu.org)


iPXE (http://ipxe.org) 00:02.0 CA00 PCI2.10 PnP PMM+7EFD1900+7EF31900 CA00
                                                                               


Booting from ROM...
c[    0.300108] kvm_intel: VMX not supported by CPU 0
Running benchmark: fio/ext4_p9_param on linux
The VM is ready for the benchmark.
P9CFG mode=read rw=read bs=16K nj=1 fsync=0 size=1G
P9CASE read-cold
p9read-cold: (g=0): rw=read, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=sync, iodepth=1
fio-3.39
Starting 1 thread

p9read-cold: (groupid=0, jobs=1): err= 0: pid=107: Sun Jul 12 15:04:11 2026
  read: IOPS=291k, BW=4551MiB/s (4772MB/s)(1024MiB/225msec)
    clat (nsec): min=557, max=1047.5k, avg=3192.66, stdev=10641.51
     lat (nsec): min=591, max=1049.0k, avg=3234.90, stdev=10645.46
    clat percentiles (nsec):
     |  1.00th=[   636],  5.00th=[  1020], 10.00th=[  1064], 20.00th=[  1096],
     | 30.00th=[  1112], 40.00th=[  1144], 50.00th=[  1160], 60.00th=[  1192],
     | 70.00th=[  1256], 80.00th=[  1512], 90.00th=[  2640], 95.00th=[  8512],
     | 99.00th=[ 50944], 99.50th=[ 69120], 99.90th=[ 93696], 99.95th=[112128],
     | 99.99th=[252928]
  lat (nsec)   : 750=2.36%, 1000=2.13%
  lat (usec)   : 2=82.51%, 4=5.27%, 10=2.85%, 20=1.29%, 50=2.52%
  lat (usec)   : 100=0.98%, 250=0.06%, 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=9.82%, sys=47.32%, ctx=3067, majf=0, minf=3
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=4551MiB/s (4772MB/s), 4551MiB/s-4551MiB/s (4772MB/s-4772MB/s), io=1024MiB (1074MB), run=225-225msec
P9DONE read-cold
P9CASE read-warm
p9read-warm: (g=0): rw=read, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=sync, iodepth=1
fio-3.39
Starting 1 thread

p9read-warm: (groupid=0, jobs=1): err= 0: pid=110: Sun Jul 12 15:04:11 2026
  read: IOPS=482k, BW=7529MiB/s (7895MB/s)(1024MiB/136msec)
    clat (nsec): min=1152, max=61630, avg=1808.13, stdev=918.25
     lat (nsec): min=1194, max=61797, avg=1857.87, stdev=932.14
    clat percentiles (nsec):
     |  1.00th=[ 1256],  5.00th=[ 1304], 10.00th=[ 1352], 20.00th=[ 1416],
     | 30.00th=[ 1464], 40.00th=[ 1528], 50.00th=[ 1592], 60.00th=[ 1672],
     | 70.00th=[ 1784], 80.00th=[ 2064], 90.00th=[ 2416], 95.00th=[ 2768],
     | 99.00th=[ 4896], 99.50th=[ 5920], 99.90th=[12224], 99.95th=[14656],
     | 99.99th=[27008]
  lat (usec)   : 2=78.78%, 4=19.60%, 10=1.45%, 20=0.14%, 50=0.02%
  lat (usec)   : 100=0.01%
  cpu          : usr=18.52%, sys=80.00%, ctx=44, majf=0, minf=3
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=7529MiB/s (7895MB/s), 7529MiB/s-7529MiB/s (7895MB/s-7895MB/s), io=1024MiB (1074MB), run=136-136msec
P9DONE read-warm
P9ALLDONE
[    3.606846] reboot: Power down